Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: Real-world problems (RWP) usually have large scale as compared to theoretical testing examples.
ru: Задачи, взятые из реального мира, (ЗРМ) как правило, имеют большие масштабы по сравнению с примерами, тестирующими теорию.

source: References
ru: Литературв

source: Regardless of whether the environment variable is local or global, all the scripts running in that shell session will have access to the variable.
ru: Независимо от того, является ли переменная среды локальной или глобальной, все сценарии, запущенные в этом сеансе bash, будут иметь доступ к переменной.

source: Regardless the method your ISP uses to get internet to your home, you will always be faced with the same problem.
ru: Независимо от того, какой метод подключения к Интернету использует интернет-провайдер, всегда сталкиваеися с одной и той же проблемой.

source: Regular Expressions
ru: Регулярные выражения

source: Regular expressions (used with scripting)
ru: Регулярные выражения, используемые в сценариях

source: Regular expressions are easily translatable from one language to the next.
ru: Регулярные выражения легко реобразуются с одного языка на другой.

source: Regular expressions exist because a literal text searching program is sometimes not good enough.
ru: Регулярные выражения существуют потому, что программы поиска текста по строке иногда недостаточно.

source: Related works
ru: Исследования-аналоги

source: Remember, $@ is a built-in variable containing all of the user arguments.
ru: Напомним, что $@ - встроенная переменная, содержащая значения всех аргументов программы.

source: Remember, a website is simply a bunch of files sitting on a server application that is running on some computer somewhere in the world.
ru: Веб-сайт - это набор файлов, находящихся в серверном приложении, запущенном на каком-то компьютере где-то в мире.

source: Remember, symbols behave differently when placed inside a character set, so be careful!
ru: Помните, что символы ведут себя по-разному, когда они помещаются внутрь выражения, а также в наборы сиволов!

source: Remember, the %MEM represents RES, which is “resident memory”, or in other words, “real memory”.
ru: Статичтика столбца %MEM включает RES, отражающий резидентную часть, или, другими словами, сколько процесс реальнно использует именно оперативную память.

source: Remember, the ? is a special character, so we must “escape it” using the backslash.
ru: Так как ? - это специальный символ, его надо "экранировать" бэкслешем, если он используется как букву.

source: Repeating application of an operation to a data results in repetitive suffixes.
ru: Повторное применение операции к данным приводит к повторяющимся суффиксам.

source: Report text
ru: Текстовый отчет

source: Research group OPE-PROTHIUS - Production and Business Management, Polytechnical university of Catalonia, Barcelona.
ru: Исследовательская группа OPE-PROTHIUS - Production and Business Management, Polytechnical university of Catalonia, Barcelona.

source: Research on the ATP in the World is going on, e.g., annually the CADE (the Conference on Automated Deduction) is being held.
ru: Исследованиям АДТ в мире уделяется внимание и по сейдень, например, ежегодно проводится конференция CADE (the Conference on Automated Deduction).

source: Researcher composes the computational process by combining different modules of bioinformatic software, data conversion, data analysis, and visualization.
ru: Исследователь составляет вычислительный процесс, комбинируя различные модули биоинформатического программного обеспечения, преобразования данных, анализа данных и визуализации.

source: Researchers have to use external software like R to build charts of the desired quality.
ru: Исследователи должны использовать внешнее программное обеспечение, такое как R, для построения диаграмм желаемого качества.

source: Results
ru: Результаты исследований

source: Review of current state of resource-based game models in discrete-event systems.
ru: Обзор текущего состояния исследований игровых моделей, основаннвх на ресурсах, в анализе дискретно-событийных систем.

source: Review of present methods of advanced control of the manufacturing process.
ru: Обзор существующих методов усоавершенствованног (advanced) управления производственным процессом.

source: Router
ru: Маршрутизатор

source: S - state (S for sleep, R for running, I for idle)
ru: S - состояние процесса: S-спячка (sleep), R-активен (running), I-простой (idle)

source: SHR - subset of RES
ru: SHR - часть RES, разделяемая память

source: SIA has three principles.
ru: АСВ базируется на трех принципах.

source: SIGCONT - kill -18 or kill -s SIGCONT (continues stopped process)
ru: SIGCONT - kill -18 or kill -s SIGCONT (продолжить выполнение процесса)

source: SIGINT (CTRL-C) - kill -2 or kill -s SIGINT (interrupt process)
ru: SIGINT (CTRL-C) - kill -2 or kill -s SIGINT (Прервать выполнение процесса)

source: SIGKILL - kill -9 or kill -s SIGKILL (brute force shutdown)
ru: SIGKILL - kill -9 or kill -s SIGKILL (силовой метод остановки процесса)

source: SIGSTOP - kill -19 or kill -s SIGSTOP (stops running process)
ru: SIGSTOP - kill -19 or kill -s SIGSTOP ([при]остановка выполнения процесса)

source: SIGTERM - kill (gracefully sends shutdown signal to process)
ru: SIGTERM - kill (мягкий сигнал завершения процесса)

source: SIGTSTP (CTRL-Z) - kill -20 or kill -s SIGTSTP (stops the running process)
ru: SIGTSTP (CTRL-Z) - kill -20 or kill -s SIGTSTP ([при]остановка выполняющегося процесса)

source: Say I wanted to replace all the commas with spaces instead.
ru: Для замены всх запятых с пробелами

source: Scroll down and find the “Extensions” dropdown and select “Remote VSCode”.
ru: Пролистайте вниз и найдите раскрывающийся список "Extensions" и выберите “Remote VSCode”.

source: Second, “sally2@customsite.net“ no longer has “.com” at the end, so this will not match our regexp.
ru: Второе - “sally2@customsite.net“ теперь без домена “.com” в конце, и теперь выражение его не находит.

source: Sed is a “stream editor” (looks at each line character by character) and is not considered a full programming language.
ru: Программа sed является редактором текстового потока (Stream EDitor): производит посимвольный просмотр файла, и не считается полноценным языком программирования.

source: See this post for a more detailed explanation.
ru: Посмотрите публикацию, где приводится более детальное объяснение сути приоритетов.

source: Send it to the background at start time
ru: Отправить его в фоновый режим в момент запуска

source: Seville, Spain: IEEE, 2005: 6680-6685.) used game theory to study the optimally of distributed predictive control, and concluded that the iterative solution has the global optimally, but the computation is complex.
ru: Seville, Spain: IEEE, 2005: 6680-6685.) использовал теорию игр для исследования оптимальности распределенного управления, и пришли к выводу, что итеративное решение глобально оптимально, но расчет вычислительно сложен.

source: Shell Variables
ru: Переменные среды

source: Shielded twisted pair (STP) cables
ru: Кабели с экранированной витой парой (STP)

source: Shouldn’t this work?
ru: Почему ничего не получилось?

source: Similar analyses are provided by the RDP; here we give you added flexibility and speed.
ru: Подобные анализы представляются технологией RDP; здесь дается дополнительная гибкость и скорость.

source: Since 1990s interest to this direction is steady low.
ru: С 1990-х годов интерес к этому направлению неуклонно низкая.

source: Since 2001 an AI direction devoted to development an instrumental software for information systems (IS) carcass synthesis.
ru: С 2001 года разивается направление искусственного интеллекта (ИИ), направленного на разработку инструментального программного обеспечения для синеза каркасов информационных систем (ИС).

source: Since 2003 cluster computing is one of the primary research direction in ISDCT SB RAS.
ru: С 2003 применение кластерных вычислений является одним из основных направлений исследований в ИДСТУ СО РАН.

source: Since it is interactive, other scripts cannot use it to get information about processes without special configurations (i.e. using “batch” mode).
ru: Поскольку top интерактивен, другие сценарии не могут использовать его для получения информации о процессах без специальных настроек (т.е. с использованием «пакетного» режима).

source: Since my site is hosted on DigitalOcean, I told NameSilo to point thediygolfer.com to DigitalOcean’s DNS servers, which are:
ru: ??? Поскольку сайт размещен на DigitalOcean, NameSilo было сообщено указывать на thediygolfer.com его DNS-серверами DigitalOcean, а именно:

source: Since the establishment a number of schools were organized.
ru: С момента организации института созданы ряд школ.

source: Since we are learning regular expressions in bash, we generally don’t need or have this functionality.
ru: В рамках bash регулярные выражения эти функции, как правило, не используются.

source: Since we are not looking to write complex process utilization scripts, we will be primarily focusing on the top command because it is more user-friendly.
ru: Поскольку мы не собираемся разрабатывать сложные скрипты использования процессов, первую очередь упор сделаем на top, поскольку она является более удобной для пользователя.

source: Since we only want to match the email addresses, we will need to tweak the expression.
ru: Поскольку требуется найти только адреса электронной почты, нам нужно настроить выражение.

source: Since you do not have a GUI to work with, you must do this with the command line.
ru: Поскольку нет графического интерфейса, нужно выполнить команду в командной строке.

source: So before we get into it, be careful!
ru: Поэтому, прежде чем запускать такие конструкции, проверяйте все десять раз!

source: So if it is 50% and your interval time is 10 seconds, this means that over the last 10 seconds, this process has taken up 50% of all available CPU time.
ru: Например, если %CPU=50, а интервал обновления составляет 10 секунд, это значит, что за последние 10 секунд, процесс пользовался 50% рабочего времени процессора, т.е. 5 секунд.

source: So if you combine the find and rm command together using exec, you may delete a bunch of files.
ru: Если вы объедините find и rm, запущенной при помощи exec, вы можете удалить найденные файлы.

source: So maybe if we add the . in the middle it will match all of them!
ru: Добавив . в центр шаблона регулярного выражения, вероятно проблема будет решена!

source: So the first step requires us to create a public/private keypair.
ru: Итак, первый шаг требует создание пары ключей.

source: So we know how to use the top command, but what does it help us with?
ru: Что же нам дает использование команды top?

source: So, the new calculi with special, including intuitionistic properties, will be devised.
ru: В конечном счете будут созданы новые варианты исчислений, включая интуиционистские.

source: Software implementation is a cloud infrastructure built on models of representation of the computational process in the form of a set of operations, structure and functions of the computing resources, and scheduling algorithms for computational resources.
ru: Программная реализация - это облачная инфраструктура, построенная на моделях представления вычислительного процесса в виде набора операций, структуры и функций вычислительных ресурсов, а также алгоритмов управления вычислительными ресурсами.

source: Some events of automata-based DES are supposed to be prohibited from occurring to restrict system behavior within constraints given by some specification.
ru: При этом предполагается, что некоторые события автоматных ДСС могут быть запрещены, обеспечивая выполнение ограничений на поведение системы в рамках ограничений, заданных в спецификации.

source: Some filtering is based on classification, which processes the whole gene data using subsampling.
ru: Некторые алгоритмы фильтрации основаны на классификации, которая обрабатывает все генетические данные, используя подвыбороки.

source: Some of the attributes, namely foreign keys, are the references to other resources, which also reflected with metadata.
ru: Некоторые атрибуты, а именно внешние ключи, являются ссылками на другие ресурсы, которые также отражаются в метаданных.

source: Sometimes the modem and the router are one and the same, but for our purposes, we will be splitting them into two for a better conceptualization of the topic.
ru: Иногда модем и маршрутизатор - это одно и то же, но здесь они разделены для лучшего понимания темы.

source: Sometimes, you will need to download software packages from the internet to your VPS.
ru: Иногда нужно загрузить пакеты программного обеспечения из Интернета на VPS.

source: Source models are UML, SysML, CMMN, BPMN2.0 representing various aspects of IS.
ru: Иходными моделями выступают UML, SysML, CMMN, BPMN2.0, представляющие различные аспекты ИС.

source: So…
ru: Однако…

source: Special subroutines will be programmed to account specific properties of multisets, their elements and relations, making multiset manipulations memory and time efficient.
ru: Будут реализованы специальные подпрограммы, учитывающие специальные свойства мультимножеств, их элементов и отношений, эффективные по времени выполнения и расходу памяти.

source: Springer, Berlin, Heidelberg), which represent transformation with a special domain specific transformation language.
ru: Springer, Berlin, Heidelberg), которые представляют трансформацию при помощи специализированных языков.

source: Springer, Berlin, Heidelberg), QVT (Query, View and Transformation language, Kurtev I. (2008) State of the Art of QVT: A Model Transformation Language Standard.
ru: Springer, Berlin, Heidelberg) и QVT (Query, View and Transformation language, Kurtev I. (2008) State of the Art of QVT: A Model Transformation Language Standard.

source: State Technical University
ru: Государственный технический университет

source: Stop it, send it to the background, and start it again
ru: Остановить его и отправить в фоновый режим и дать команду продолжения исполнения

source: Store our search string in a variable
ru: Сохранить искомую строку в переменной

source: Stuff publishes 20 paper per year.
ru: Сотрудники группы публикуют по 20 статй в год.

source: Subsequently, a generalized approach, so-called general architecture of a decentralized supervisor (T.-S.
ru: Впоследствии предложен обобщенный подход, так называемая общенная архитектура децентрализованного управления (T.-S.

source: Such systems are subject of optimal control.
ru: Такие системы являются предметом оптимального управления.

source: Sure, there are a lot of options and little details to learn regarding regular expressions, and on top of that, there are many different flavors of regular expressions (python, extended, rust, etc.).
ru: Есть много вариантов и мелких деталей, которые надо знать о регулярных выражениях, и, кроме того, существует множество различных разновидностей регулярных выражений (python, extended, rust и т. Д.).

source: Sure, there will be times where the above concepts are not enough, but again, this is an introduction to scripting rather than a deep dive.
ru: Конечно, есть задачи, при решении которых вышеуказанных концепций будет недостаточно, тем не менее рассмотрим только часто используемые конструкции.

source: Sure, you could use the Vim text editor for all of your development needs on a VPS, but it is nice to have a feature-rich text editor like VSCode.
ru: Конечно, можно использовать текстовый редактор Vim для решения всех задач в разработке программ прямо на VPS, но хорошо иметь под рукой многофункциональный текстовый редактор, такой как VSCode.

source: Swap memory is only used when real memory is exhausted, so if you start seeing low numbers in the “free” part of real memory and high numbers in the “used” part of swap memory, there could be a performance issue on your computer caused by too little RAM.
ru: Подкачка используется только тогда, когда реальная память исчерпана, так низкие цифры в "свободной" части реальной памяти и высокие цифры в "использованной" части своп - признак возникновения проблемы производительности системы, что, как правило, вызвано слишком малым размером оперативной памяти.

source: Swap memory statistics.
ru: Статистика памяти swap (подкачки).

source: System Management
ru: Управление системой

source: Systems are tested on the basis of a specialized library of problems TPTP (Thousands problems for theorem provers).
ru: Системы соревнуются, решая задачи из специализированной библиотеки TPTP (Thousands problems for theorem provers).

source: TIME+ - The total time the process has used since start time (assuming cumulative mode is on - toggle it with S)
ru: TIME+ - Общее время вычислений процесса с момаента его запуска в предположении, что вблучем "накопительный" режим, который переключается при помощи S)

source: Technique manual implementation issues
ru: "Проблемы" ручной реализацией техники

source: Techniques for formulation of the production scheduling model, and deal with the internal uncertain factors of manufacturing process based on the chance constraint programming and fuzzy theory [6] have been developed.
ru: разработаны методики формирования моделей планирования расписания производственного процесса, а также методы борьбы с внутренними факторами неопределености производственного процесса, основанные на программировании в вероятностных ограничениях (chance constraint programming) и теории нечетких множеств [6] были разработаны.

source: Testing the obtained computer simulation on the data close to real.
ru: Тестирование полученных результатов имитационного моделирования на данных, приближенных к реальным.

source: That is where the ps command enters the picture.
ru: Вот где пригодится команда ps.

source: That purpose is to convert human readable domain names into IP addresses.
ru: Эта цель - преобразовать удобочитаемые доменные имена в IP-адреса.

source: That said, character classes make your life easier in many cases, so we need to cover them at least briefly.
ru: Классы символов позволяют упрощать выражения, поэтому посвятим им немного времени.

source: That said, it would be nice if we could control the interval length.
ru: Интервалом обновления также можно управлять.

source: That said, knowing the basic usage of each can significantly speed up your workflow during those few moments where they do become necessary.
ru: Тем не менее, знание основ использования этих команд может значительно ускорить ваш рабочий процесс при решении простых задач, которые периодически возникают.

source: That said, the concepts apply across the board whether you are using AWS, Azure, etc.
ru: Эти концепции применимы повсеместно, независимо от того, используются ли AWS, Azure и т.д.

source: That said, there are certain situations where this could be useful.
ru: Выражения со скобками полезны, если полный класс не является допустимым в решении задачи.

source: That said, this section will get into the most common Bash networking utilities that you can use to diagnose network issues on your computer.
ru: В этом разделе описаны наиболее распространенные сетевые утилиты Bash, которые можно использовать для диагностики сетевых проблем на компьютере.

source: The -d flag will test whether a given name is a directory.
ru: Флаг -d проверяет, является ли name каталогом.

source: The . character matches literally inside brackets
ru: Символ "." соответствует символу "точка", если помещен в квадратные скобки

source: The dig, host, and whois utilities help find information about domain names, IP addresses, and the mapping between them.
ru: Программы dig, host и whois помогают узнавать информацию о доменных именах, IP-адресах и механизмах отобрахения одних в другие.

source: The ping command is a basic utility you can use to check connectivity between devices on your LAN or even between devices outside your LAN.
ru: Программа ping - это базовая утилита, используемая для проверки связи между устройствами в локальной сети или даже между устройствами за пределами локальной сети.

source: The ^ still indicates that we are looking at the beginning of each line.
ru: Символ ^, ка и раньше обозначает начало строки.

source: The [^\r\n] means that we are matching any character that is not (^) a carriage return or new line (\r, \n).
ru: Символы [^\r\n] обозначают любые символы, которые не (^) являются концами строк (\r, \n).

source: The CIM is also obtained automatically from the analysis of the C++ source code of Mothur.
ru: CIM также получается автоматически в результате анализа исходного кода C ++ Mothur.

source: The HPC techniques review we will start with application of BOINC technology to alignment presented in [12], where Novoalign algorithm was scaled.
ru: Обзор методов HPC начнем с применения технологии BOINC для выравнивания, представленной в [12], где отмасштабирован алгоритм Novoalign.

source: The LOD service and the required flexibility of scientific research software requires us to associate metadata to all pieces of NGS data.
ru: Служба LOD и необходимая гибкость программного обеспечения для научных исследований требует, чтобы метаданные связывались со всеми элементами данных NGS.

source: The NGS SaaS services [3], [13] could also be integrated in the cloud under development.
ru: Сервисы NGS SaaS [3], [13] также могут быть интегрированы в разрабатываемое облако.

source: The PCF language expresses logical inference as a question-answering procedure, which looks like application rules in forward-chaining inferences (CLIPS, DROOLS), but supports disjunctive branching in the consequent part, which is naturally expresses variants of system evolution in a virtual future.
ru: ПОФ-язык представляют логический вывод как вопросно-ответную процедуру, которая реализует логический вывод от фактов к заключениям по аналогии с CLIPS и DROOLS (forward-chaining), но и поддерживает дизъюнктивное ветвление в консекванте, которое естественным образом выражает варианты эволюции системы в виртуальном будущем.

source: The Python programming language is exceptionally useful in construction model construction and investigation scientific environments.
ru: Язык программирования Python является чрезвычайно полезными в реализации процедур пострения структур моделей и создания программ для научных исследований.

source: The above method belong to a class of non-cooperative distributed predictive control.
ru: Этот метод, относится к классу некооперативных распределенных предиктивных управлений.

source: The above regular expressions will get us a lot closer.
ru: Эти примеры приблилили нас к решению задачи.

source: The activity of an industry (as well as a service) in competitive environment usually modeled by means of various approaches of game theory.
ru: Поведение предприятия в условиях конкурентной среды, как правило, моделируется при помощи различных подходов теории игр (ТИ).

source: The advantage here is the ability to see four windows that are all configured slightly different at the same time.
ru: Удобство заключается в возможности видеть четыре окна, которые все настроены на определенные варианты просмотра процессов.

source: The aim of this study is to develop mathematical and software support of the processes of analysis of the results of Next Generation Sequencing (NGS).
ru: Целью данного исследования является разработка математического и программного обеспечения процессов анализа результатов секвенирования следующего поколения (NGS).
